Revit 2027 API
RebarContainerParameterManager.AddOverride(ElementId, String) Method
 Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddOverride(
	ElementId paramId,
	string value
)
Public Sub AddOverride (
	paramId As ElementId,
	value As String
)
public:
void AddOverride(
	ElementId^ paramId,
	String^ value
)
member AddOverride :
        paramId : ElementId *
        value : string -> unit
Parameters
paramId ElementId
 The id of the parameter
value String
 The override value of the parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not the id of a parameter in the current document, or its value type is not sring. -or- paramId is not a Rebar Container parameter
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
AddOverride Overload
Autodesk.Revit.DB.Structure Namespace